---
kind: other
id: Methods.T:Autodesk.Revit.UI.UIApplication
source: html/339e8cb5-4e0c-68e5-5314-bb010bce36b4.htm
---
# UIApplication Methods

Identifies if the given command can be posted, using PostCommand(RevitCommandId) .